Wannesgarrevoet/nbus-esp32/firmware/firmware.ino
// N-Bus ESP32-C3 firmware — passively reads a Büttner/Dometic NDS "N-Bus" (LIN,
// 19200 baud) and republishes values over MQTT with Home Assistant auto-discovery,
// WiFiManager provisioning and ElegantOTA web updates.
//
// SAFETY: read-only. The LIN UART is opened RX-only (TX pin = -1). Never transmit.
//
// Board: ESP32-C3 Super Mini  ·  FQBN esp32:esp32:esp32c3 (USB CDC On Boot enabled).

#include <Preferences.h>
#include <WebServer.h>
#include <LittleFS.h>
#include <WiFi.h>
#include <WiFiManager.h>     // tzapu
#include <PubSubClient.h>    // knolleary
#include <ArduinoJson.h>     // bblanchon (v7)
#include <ElegantOTA.h>      // ayushsharma82
#include "esp_mac.h"
#include "esp_system.h"
#include "esp_task_wdt.h"

#include "Config.h"
#include "NBusParser.h"

// Print raw frame windows and decoded registers over USB serial. Comment out once the
// bus is fully mapped; the raw dump is what makes unknown registers visible.
#define NBUS_DEBUG 1

// --------------------------------------------------------------------------
// Globals
// --------------------------------------------------------------------------
// Declared up here rather than beside the ring-buffer code that uses it: the .ino
// preprocessor hoists generated prototypes to the top of the file, so any type
// named in a function signature must already exist before the first function.
struct RawEntry {
  uint32_t ms;
  uint8_t  d[8];   // NAD PCI SID reg d0 d1 d2 d3 — checksum already verified, so not stored
};

HardwareSerial   LinSerial(NBUS_UART_NUM);
NBusParser       parser;
// Decides which pack a NAD 0x85 frame belongs to. See NBusParser.h for why this is done
// by position in the poll cycle rather than by timing.
NBusCycleTracker cycles;
Preferences      prefs;
WiFiClient       wifiClient;
PubSubClient     mqtt(wifiClient);
WebServer        httpServer(80);

// The portal runs non-blocking, so WiFiManager and its parameters must outlive
// startProvisioning() — it keeps pointers to them and services them from loop().
WiFiManager           wm;
WiFiManagerParameter  pHost("host", "MQTT host", "", 64);
WiFiManagerParameter  pPort("port", "MQTT port", "", 8);
WiFiManagerParameter  pUser("user", "MQTT user", "", 48);
WiFiManagerParameter  pPass("pass", "MQTT password", "", 48);
WiFiManagerParameter  pBase("base", "Base topic", "", 32);
WiFiManagerParameter  pOtaU("otau", "OTA user (optional)", "", 32);
WiFiManagerParameter  pOtaP("otap", "OTA password (optional)", "", 32);

struct MqttConfig {
  String host;
  uint16_t port = 1883;
  String user;
  String pass;
  String base;       // base topic, e.g. "nbus"
  String otaUser;
  String otaPass;
} cfg;

bool g_shouldSaveConfig = false;
bool g_portalActive     = false;
bool g_netServicesUp    = false;

// Per-group last-seen timestamps for staleness.
// Freshness is per pack, not per NAD: both packs answer on 0x85, so a single timestamp
// would let a live pack vouch for a silent one.
uint32_t g_lastBattMs[NBUS_MAX_BATTERIES] = {0};
uint32_t g_lastCellMs[NBUS_MAX_BATTERIES] = {0};
uint32_t g_lastSolarMs   = 0;
uint32_t g_lastStarterMs = 0;

uint32_t g_lastPublishMs   = 0;
uint32_t g_lastMqttTryMs   = 0;
uint32_t g_lastHeartbeatMs = 0;
bool     g_discoverySent   = false;
uint8_t  g_mqttFailCount   = 0;

// Up here rather than with the rest of the ring state further down, because the OTA
// callbacks in setupWeb() touch both and are registered before that block.
uint32_t g_lastFrameMs = 0;
bool     g_otaActive   = false;

// --------------------------------------------------------------------------
// LED helpers
// --------------------------------------------------------------------------
static inline void ledWrite(bool on) {
#if NBUS_LED_ACTIVE_LOW
  digitalWrite(NBUS_LED_PIN, on ? LOW : HIGH);
#else
  digitalWrite(NBUS_LED_PIN, on ? HIGH : LOW);
#endif
}

// --------------------------------------------------------------------------
// Persistent config (NVS)
// --------------------------------------------------------------------------
void loadConfig() {
  prefs.begin("nbus", true);
  cfg.host    = prefs.getString("host", NBUS_DEFAULT_MQTT_HOST);
  cfg.port    = prefs.getString("port", NBUS_DEFAULT_MQTT_PORT).toInt();
  cfg.user    = prefs.getString("user", NBUS_DEFAULT_MQTT_USER);
  cfg.pass    = prefs.getString("pass", NBUS_DEFAULT_MQTT_PASS);
  cfg.base    = prefs.getString("base", NBUS_DEFAULT_BASE_TOPIC);
  cfg.otaUser = prefs.getString("otau", "");
  cfg.otaPass = prefs.getString("otap", "");
  prefs.end();
  if (cfg.port == 0) cfg.port = 1883;
  if (cfg.base.isEmpty()) cfg.base = NBUS_DEFAULT_BASE_TOPIC;
}

void saveConfig() {
  prefs.begin("nbus", false);
  prefs.putString("host", cfg.host);
  prefs.putString("port", String(cfg.port));
  prefs.putString("user", cfg.user);
  prefs.putString("pass", cfg.pass);
  prefs.putString("base", cfg.base);
  prefs.putString("otau", cfg.otaUser);
  prefs.putString("otap", cfg.otaPass);
  prefs.end();
}

// --------------------------------------------------------------------------
// Wi-Fi provisioning
// --------------------------------------------------------------------------
bool mqttConnect();
void onWifiUp();

void onSaveConfig() { g_shouldSaveConfig = true; }

void eraseSettings() {
  Serial.println(F("[setup] erasing settings"));
  wm.resetSettings();
  prefs.begin("nbus", false);
  prefs.clear();
  prefs.end();
  for (int i = 0; i < 6; ++i) { ledWrite(true); delay(80); ledWrite(false); delay(80); }
}

// Wipe Wi-Fi + MQTT settings when the BOOT button is held at power-on.
//
// GPIO9 doubles as the boot strapping pin that the USB host drives via DTR, so a
// serial terminal opening the port can pull it low a few hundred ms after the ROM
// has already sampled it high. Two gates make that harmless: the erase only runs
// after a true power-on reset (every USB-induced reset is excluded), and the pin
// must stay low for NBUS_FACTORY_HOLD_MS — far longer than any DTR pulse.
void maybeFactoryReset() {
  if (esp_reset_reason() != ESP_RST_POWERON) return;

  pinMode(NBUS_SETUP_BTN_PIN, INPUT_PULLUP);
  delay(50);
  if (digitalRead(NBUS_SETUP_BTN_PIN) != LOW) return;

