Wannesgarrevoet/nbus-esp32/firmware/firmware.ino
  String topic = String(NBUS_HA_PREFIX) + "/sensor/" + NBUS_DEVICE_ID + "_" + key + "/config";
  String payload;
  serializeJson(doc, payload);
  mqtt.publish(topic.c_str(), payload.c_str(), true);
}

// Discovery for a hand-picked set of registers the parser does not decode.
//
// The mirror republishes every undecoded register, but most of them never move and would
// only clutter Home Assistant. The ones here are those whose *history* is the evidence: a
// bitmap that reads zero today and non-zero for two seconds during the fault proves
// nothing unless something recorded when it flipped, and a retained MQTT message holds one
// value, not a history. Getting them into the recorder is the whole point.
//
// Naming them after their address rather than a guess is what keeps this honest — the
// entity claims a register, not a meaning. That is also why an empty template leaves the
// payload as the raw hex string: no unit, no state class, nothing to mislead.
struct RegSensor {
  const char* key;
  uint8_t     nad;
  uint8_t     reg;
  const char* name;
  const char* valTpl;    // "" ⇒ publish the eight hex characters unchanged
  const char* unit;
  const char* stateCla;
};

const RegSensor kRegSensors[] = {
  // Was a steady 270 on pack firmware 4.x, which made "two temperature sensors at 27.0 °C"
  // look plausible. Firmware 5.1 reports 0 in both halves, so that reading is dead: a
  // temperature does not become exactly zero across an update while the pack sits at the
  // same bench temperature. Published raw now — the °C it used to claim was a guess that
  // the update disproved, and a wrong unit is worse than none.
  { "reg_85_90", 0x85, 0x90, "0x90 raw", "", "", "" },

  // Alarm-bitmap candidates: all zero on a healthy bus, which is indistinguishable from
  // "unused" until one of them flips.
  { "reg_85_c0", 0x85, 0xC0, "0xC0 raw", "", "", "" },
  { "reg_85_f1", 0x85, 0xF1, "0xF1 raw", "", "", "" },
  { "reg_85_f2", 0x85, 0xF2, "0xF2 raw", "", "", "" },
  { "reg_81_c0", 0x81, 0xC0, "0xC0 raw", "", "", "" },
  { "reg_81_f0", 0x81, 0xF0, "0xF0 raw", "", "", "" },
  { "reg_81_f1", 0x81, 0xF1, "0xF1 raw", "", "", "" },

  // Recorded as a constant 730 for as long as captures were 5.5 minutes long; the first
  // day of real history put it at 740. Candidate cycle count. Both packs report the same
  // value, so whatever it counts is not a per-pack measurement — worth watching to see
  // whether they ever diverge.
  { "reg_85_0c", 0x85, 0x0C, "0x0C value", "{{ value[0:4] | int(base=16) }}", "", "measurement" },

  // New with pack firmware 5.1; absent on 4.x. Four bytes that read 76/75/76/10 on one
  // pack and 75/75/75/10 on the other — per-pack, roughly equal in the first three, which
  // is the shape three sensors of the same quantity would have. Deliberately unitless:
  // that shape is a hint, not a decode, and the whole point of the mirror is to record
  // candidates without naming them.
  { "reg_85_14_a", 0x85, 0x14, "0x14 byte 0", "{{ value[0:2] | int(base=16) }}", "", "measurement" },
  { "reg_85_14_b", 0x85, 0x14, "0x14 byte 1", "{{ value[2:4] | int(base=16) }}", "", "measurement" },
  { "reg_85_14_c", 0x85, 0x14, "0x14 byte 2", "{{ value[4:6] | int(base=16) }}", "", "measurement" },
  { "reg_85_14_d", 0x85, 0x14, "0x14 byte 3", "{{ value[6:8] | int(base=16) }}", "", "measurement" },

  // Both move, neither follows anything instantaneous; 0x11 lags the output badly.
  { "reg_81_11", 0x81, 0x11, "0x11 value", "{{ value[0:4] | int(base=16) }}", "", "measurement" },
  { "reg_81_1c", 0x81, 0x1C, "0x1C value", "{{ value[0:4] | int(base=16) }}", "", "measurement" },
};

// Register-mirror topics name the device, not the NAD. Both packs answer on 0x85, so a
// NAD-keyed topic would have them overwrite each other — silently, and with plausible
// values, which is the worst possible way to be wrong.
String regTopic(int slot, uint8_t reg) {
  char buf[32];
  if (slot == NBusCycleTracker::kSolarSlot) snprintf(buf, sizeof buf, "/reg/81/%02X", reg);
  else snprintf(buf, sizeof buf, "/reg/85_%d/%02X", slot + 1, reg);
  return cfg.base + buf;
}

void publishRegDiscovery(int slot, const String& devSuffix, const String& devName,
                         const char* devModel, const String& devSw) {
  const uint8_t nad = (slot == NBusCycleTracker::kSolarSlot) ? NBUS_NAD_SOLAR
                                                             : NBUS_NAD_BATTERY;
  for (const auto& r : kRegSensors) {
    if (r.nad != nad) continue;
    // The entity key carries the serial so the entity follows its pack, not its slot.
    const String key = devSuffix + "_" + r.key;
    publishDiscoverySensor(key.c_str(), r.name, regTopic(slot, r.reg).c_str(),
                           r.valTpl, r.unit, "", r.stateCla,
                           devSuffix, devName, devModel, devSw);
  }
}

// Discovery for one battery pack. Keyed on the pack's serial number, never on its slot
// or bus address: the firmware update moved both of those (slot order swapped, address
// went 3 -> 11) while the serial stayed put. An entity keyed on either would have
// silently started reporting the other pack.
void publishBatteryDiscovery(int slot) {
  const NBusBattery& b = parser.state().batt[slot];
  const String sfx  = String("b") + b.id.serial;              // e.g. bKAA1234567
  const String name = String("Leisure battery ") + b.id.serial;
  const String sw   = b.id.fw_valid
                    ? String(b.id.fw_major) + "." + String(b.id.fw_minor) : String();
  const String bt   = batteryTopic(slot);

  struct { const char* key; const char* name; const char* tpl; const char* unit;
           const char* cla; const char* sta; } kFields[] = {
    { "soc",        "SoC",               "{{ value_json.soc }}",      "%",  "battery",        "measurement" },
    { "voltage",    "Voltage",           "{{ value_json.voltage }}",  "V",  "voltage",        "measurement" },
    { "current",    "Current",           "{{ value_json.current }}",  "A",  "current",        "measurement" },
    { "power",      "Power",             "{{ value_json.power }}",    "W",  "power",          "measurement" },
    { "cell1",      "Cell 1 voltage",    "{{ value_json.cells[0] }}", "V",  "voltage",        "measurement" },
    { "cell2",      "Cell 2 voltage",    "{{ value_json.cells[1] }}", "V",  "voltage",        "measurement" },
    { "cell3",      "Cell 3 voltage",    "{{ value_json.cells[2] }}", "V",  "voltage",        "measurement" },
    { "cell4",      "Cell 4 voltage",    "{{ value_json.cells[3] }}", "V",  "voltage",        "measurement" },
    { "energy",     "Energy remaining",  "{{ value_json.energy }}",   "Wh", "energy_storage", "measurement" },
    { "quality",    "Quality",           "{{ value_json.quality }}",  "%",  "",               "measurement" },
    { "capacity",   "Capacity",          "{{ value_json.capacity }}", "Ah", "",               "measurement" },
    // The pack reports its own runtime estimate in register 0x34; nothing is derived
    // here. Only the half matching the current direction of travel is ever published.
    { "to_empty",   "Time to empty",     "{{ value_json.to_empty }}", "min", "duration",      "measurement" },
    { "to_full",    "Time to full",      "{{ value_json.to_full }}",  "min", "duration",      "measurement" },
    // Lifetime counters, so total_increasing rather than measurement: HA must not read a
    // counter reset as a huge negative reading. The update reset both of these to ~0.
    { "discharged", "Energy discharged", "{{ value_json.discharged }}", "Wh", "energy", "total_increasing" },
    { "charged",    "Energy charged",    "{{ value_json.charged }}",    "Wh", "energy", "total_increasing" },
    // Bus address, so a reshuffle is visible in the history rather than inferred from it.
    { "address",    "Bus address",       "{{ value_json.address }}",    "",   "",       "" },
  };
  for (const auto& f : kFields) {
    const String key = sfx + "_" + f.key;
    publishDiscoverySensor(key.c_str(), f.name, bt.c_str(), f.tpl, f.unit, f.cla, f.sta,
                           sfx, name, "NDS Tempra", sw);
  }
  publishRegDiscovery(slot, sfx, name, "NDS Tempra", sw);
}

void publishSolarDiscovery() {
  const NBusSolar& s = parser.state().solar;
  const String sfx  = String("s") + s.id.serial;
  const String name = String("Solar charger ") + s.id.serial;
  const String sw   = s.id.fw_valid
                    ? String(s.id.fw_major) + "." + String(s.id.fw_minor) : String();
  const String st = solarTopic();
  const String rt = starterTopic();

  publishDiscoverySensor((sfx + "_voltage").c_str(), "Voltage", st.c_str(),
                         "{{ value_json.voltage }}", "V", "voltage", "measurement",
                         sfx, name, "NDS MPPT", sw);
  publishDiscoverySensor((sfx + "_current").c_str(), "Charge current", st.c_str(),
                         "{{ value_json.current }}", "A", "current", "measurement",
                         sfx, name, "NDS MPPT", sw);
  // The starter battery has no node of its own; the charger is what measures it.
  publishDiscoverySensor((sfx + "_starter").c_str(), "Starter battery voltage", rt.c_str(),
                         "{{ value_json.voltage }}", "V", "voltage", "measurement",
                         sfx, name, "NDS MPPT", sw);
  publishDiscoverySensor((sfx + "_address").c_str(), "Bus address", st.c_str(),
                         "{{ value_json.address }}", "", "", "",
                         sfx, name, "NDS MPPT", sw);
  publishRegDiscovery(NBusCycleTracker::kSolarSlot, sfx, name, "NDS MPPT", sw);
}

// Bridge-level diagnostics. These describe the reader, not the bus, so they hang off the
// ESP's own device and are published as soon as MQTT is up.
void publishBridgeDiscovery() {
  const String ct = cfg.base + "/cycle";
  publishDiscoverySensor("cycle_expected", "Poll cycle length", ct.c_str(),
                         "{{ value_json.expected }}", "", "", "measurement");
  // If this climbs steadily, frames are being lost and readings are being thrown away
  // rather than misattributed — the trade this design deliberately makes.
  publishDiscoverySensor("cycle_dropped", "Poll cycles dropped", ct.c_str(),
                         "{{ value_json.dropped }}", "", "", "total_increasing");
  publishDiscoverySensor("cycle_accepted", "Poll cycles accepted", ct.c_str(),
                         "{{ value_json.accepted }}", "", "", "total_increasing");
}

