Wannesgarrevoet/nbus-esp32/firmware/firmware.ino
// Discovery is (re)published whenever the set of identified devices changes — on connect,
// and again when a pack's serial first arrives or a reshuffle points a slot at a different
// pack. Every message is retained and idempotent, so republishing costs nothing.
String g_discoSignature;

String identitySignature() {
  String s;
  for (int i = 0; i < NBUS_MAX_BATTERIES; ++i) {
    s += parser.state().batt[i].id.serial;
    s += '|';
  }
  s += parser.state().solar.id.serial;
  return s;
}

void publishDiscovery() {
  publishBridgeDiscovery();
  // A pack is published only once its serial is known. Naming it after its slot in the
  // meantime would create an entity that a later reshuffle silently repoints at the other
  // pack — exactly the failure this whole change exists to remove. The serial arrives
  // within seconds of boot; until then the pack is simply absent, which is honest.
  for (int i = 0; i < NBUS_MAX_BATTERIES; ++i) {
    if (parser.state().batt[i].id.serialValid()) publishBatteryDiscovery(i);
  }
  if (parser.state().solar.id.serialValid()) publishSolarDiscovery();
  g_discoSignature = identitySignature();
  Serial.printf("[mqtt] discovery published (%s)\n", g_discoSignature.c_str());
}

bool mqttConnect() {
  if (cfg.host.isEmpty()) return false;
  mqtt.setServer(cfg.host.c_str(), cfg.port);
  mqtt.setBufferSize(512);

  String clientId = String(NBUS_DEVICE_ID) + "-" + String((uint32_t)ESP.getEfuseMac(), HEX);
  const char* user = cfg.user.isEmpty() ? nullptr : cfg.user.c_str();
  const char* pass = cfg.pass.isEmpty() ? nullptr : cfg.pass.c_str();

  bool ok = mqtt.connect(clientId.c_str(), user, pass,
                         statusTopic().c_str(), 0, true, "offline");
  if (ok) {
    mqtt.publish(statusTopic().c_str(), "online", true);
    g_discoverySent = false;  // re-send discovery on (re)connect
    g_mqttFailCount = 0;
    Serial.println(F("[mqtt] connected"));
  } else {
    Serial.print(F("[mqtt] connect failed, state="));
    Serial.println(mqtt.state());
  }
  return ok;
}

// --------------------------------------------------------------------------
// State publishing
// --------------------------------------------------------------------------
void publishState() {
  const NBusState& s = parser.state();
  const uint32_t now = millis();

  // One message per pack. Publishing a pack whose serial is unknown would feed a topic
  // that no entity is subscribed to, so skip it.
  for (int i = 0; i < NBUS_MAX_BATTERIES; ++i) {
    const NBusBattery& b = s.batt[i];
    if (!b.id.serialValid()) continue;
    if (!b.voltage_valid || (now - g_lastBattMs[i]) >= NBUS_STALE_MS) continue;

    JsonDocument doc;
    doc["serial"] = b.id.serial;
    if (b.id.address_valid) doc["address"] = b.id.address;
    if (b.soc_valid)      doc["soc"]      = b.soc;
    doc["voltage"] = roundf(b.voltage * 100) / 100.0;
    if (b.wh_valid)       doc["energy"]   = b.wh;
    if (b.quality_valid)  doc["quality"]  = b.quality;
    if (b.capacity_valid) doc["capacity"] = b.capacity_ah;
    // These two alternate: 0x34 sends FFFF for whichever direction does not apply, so one
    // of them is invalid at all times. Omitting the key would leave the template rendering
    // an empty string, which Home Assistant treats as "no update" — the entity would then
    // hold the last figure from the opposite direction indefinitely. An explicit null
    // renders as "None", which does set the state to unknown.
    if (b.to_empty_valid) doc["to_empty"] = b.to_empty_min; else doc["to_empty"] = nullptr;
    if (b.to_full_valid)  doc["to_full"]  = b.to_full_min;  else doc["to_full"]  = nullptr;
    if (b.discharged_valid) doc["discharged"] = b.discharged_wh;
    if (b.charged_valid)    doc["charged"]    = b.charged_wh;
    if (b.current_valid) {
      doc["current"] = roundf(b.current * 100) / 100.0;
      doc["power"]   = roundf(b.voltage * b.current * 10) / 10.0;
    }
    const bool anyCell = b.cell_valid[0] || b.cell_valid[1] ||
                         b.cell_valid[2] || b.cell_valid[3];
    if (anyCell && (now - g_lastCellMs[i]) < NBUS_STALE_MS) {
      JsonArray cells = doc["cells"].to<JsonArray>();
      for (int c = 0; c < 4; ++c) cells.add(roundf(b.cell_v[c] * 1000) / 1000.0);
    }
    String payload; serializeJson(doc, payload);
    mqtt.publish(batteryTopic(i).c_str(), payload.c_str(), true);
  }

  // Solar charger
  if (s.solar.valid && (now - g_lastSolarMs) < NBUS_STALE_MS) {
    JsonDocument doc;
    doc["voltage"] = roundf(s.solar.voltage * 100) / 100.0;
    doc["current"] = roundf(s.solar.current * 100) / 100.0;
    if (s.solar.id.address_valid) doc["address"] = s.solar.id.address;
    if (s.solar.id.serialValid()) doc["serial"] = s.solar.id.serial;
    String payload; serializeJson(doc, payload);
    mqtt.publish(solarTopic().c_str(), payload.c_str(), true);
  }

  // Starter battery
  if (s.solar.starter_valid && (now - g_lastStarterMs) < NBUS_STALE_MS) {
    JsonDocument doc;
    doc["voltage"] = roundf(s.solar.starter_voltage * 100) / 100.0;
    String payload; serializeJson(doc, payload);
    mqtt.publish(starterTopic().c_str(), payload.c_str(), true);
  }

  // How the frame split is holding up. This is the health of the attribution itself, so
  // it belongs in the recorder alongside the readings it vouches for.
  {
    JsonDocument doc;
    doc["expected"] = cycles.expectedPerCycle();
    doc["accepted"] = cycles.cyclesAccepted();
    doc["dropped"]  = cycles.cyclesDropped();
    doc["epoch"]    = cycles.topologyEpoch();
    String payload; serializeJson(doc, payload);
    mqtt.publish((cfg.base + "/cycle").c_str(), payload.c_str(), true);
  }
}

// --------------------------------------------------------------------------
// Raw register mirror
//
// Registers the parser understands become named sensors above. Everything else would
// otherwise be discarded, and that is precisely the data a post-mortem needs: on a
// healthy bus the candidate alarm registers (0xC0, 0xF0, 0xF1, 0xF2) are all zero, which
// looks exactly like an unused register. Only a capture taken while the fault is
// happening can tell those apart, and the fault is intermittent — so it has to be
// recorded continuously, unattended.
//
// Each pair gets its own retained topic, so the broker timestamps every change for free
// and a constant register costs one message ever. No discovery config is published:
// naming an entity would claim a meaning we have not established.
// --------------------------------------------------------------------------
struct RegMirror {
  int8_t   busSlot = 0;            // poll slot, or NBusCycleTracker::kSolarSlot
  uint8_t  reg = 0;
  uint8_t  data[4] = {0, 0, 0, 0};
  uint32_t lastPubMs = 0;
  bool     used = false;
};
