Wannesgarrevoet/nbus-esp32/firmware/firmware.ino
    // Record before dispatching. The ring is deliberately indiscriminate: a frame
    // the parser already understands is still evidence, and the registers we have
    // not decoded yet are exactly the ones a fault is most likely to show up in.
    ringPush(d);
    g_lastFrameMs = millis();

#ifdef NBUS_DEBUG
    Serial.printf("[lin] NAD %02X reg %02X : %02X %02X %02X %02X\n",
                  d[0], d[3], d[4], d[5], d[6], d[7]);
#endif

    // Nothing is decoded straight from the wire any more. Both packs answer on NAD 0x85,
    // so a frame only acquires an owner once its whole poll cycle has closed and the
    // cycle's length confirms nothing was lost. The tracker therefore returns frames in
    // bursts, one cycle at a time, and returns none at all for a cycle it cannot vouch for.
    if (d[1] == 0x06 && d[2] == 0xF4) {
      NBusCycleTracker::Out out[NBusCycleTracker::kMaxPerCycle + 1];
      const uint32_t epochBefore = cycles.topologyEpoch();
      const int n = cycles.feed(d[0], d[3], &d[4], out, sizeof out / sizeof out[0]);

      // A device joined or left the bus: the slots have been renumbered, so everything
      // held against them describes the wrong pack. Drop it all and let discovery
      // re-publish once the new occupants have named themselves.
      if (cycles.topologyEpoch() != epochBefore) {
        parser.forgetBatteries();
        forgetBatteryMirror();
        for (int i = 0; i < NBUS_MAX_BATTERIES; ++i) g_lastBattMs[i] = g_lastCellMs[i] = 0;
        Serial.printf("[bus] poll cycle changed to %d battery frames; slots cleared\n",
                      cycles.expectedPerCycle());
      }
      for (int i = 0; i < n; ++i) dispatchFrame(out[i]);
    }
    return;  // one response per window
  }
}

void readLin() {
  static uint8_t buf[NBUS_RX_BUF];
  static size_t  len = 0;
  static uint32_t lastByteUs = 0;

  while (LinSerial.available() > 0) {
    int b = LinSerial.read();
    if (b < 0) break;
    if (len < sizeof buf) buf[len++] = (uint8_t)b;
    lastByteUs = micros();
  }

  if (len > 0 && (micros() - lastByteUs) > NBUS_FRAME_GAP_US) {
    processFrameWindow(buf, len);
    len = 0;
  } else if (len >= sizeof buf) {
    processFrameWindow(buf, len);
    len = 0;
  }
}

// --------------------------------------------------------------------------
// Watchdog (Arduino-ESP32 core ≥ 3.x uses a config struct)
// --------------------------------------------------------------------------
void watchdogInit() {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  esp_task_wdt_config_t wdt_cfg = {};
  wdt_cfg.timeout_ms = NBUS_WDT_TIMEOUT_S * 1000;
  wdt_cfg.idle_core_mask = 0;
  wdt_cfg.trigger_panic = true;
  esp_task_wdt_reconfigure(&wdt_cfg);  // TWDT already initialised by the core
  esp_task_wdt_add(NULL);
#else
  esp_task_wdt_init(NBUS_WDT_TIMEOUT_S, true);
  esp_task_wdt_add(NULL);
#endif
}

// --------------------------------------------------------------------------
// Arduino entry points
// --------------------------------------------------------------------------
void setup() {
  pinMode(NBUS_LED_PIN, OUTPUT);
  ledWrite(false);

  Serial.begin(115200);
  delay(200);
  Serial.printf("\n[boot] N-Bus ESP32-C3 firmware %s (%s)\n", NBUS_FW_VERSION, NBUS_FW_BUILD);

  maybeFactoryReset();
  loadConfig();
  // An unset broker host silently disables MQTT, which looks identical to a broker
  // that refuses the connection. Say which of the two it is.
  if (cfg.host.isEmpty()) {
    Serial.println(F("[cfg] no MQTT broker configured - set one at http://<device-ip>/config"));
  } else {
    Serial.printf("[cfg] MQTT %s:%u, user '%s', base '%s'\n",
                  cfg.host.c_str(), cfg.port, cfg.user.c_str(), cfg.base.c_str());
  }

  rawFsInit();

  // LIN UART: RX-only. TX pin is -1 — the bus is never driven.
  LinSerial.begin(NBUS_BAUD, SERIAL_8N1, NBUS_RX_PIN, NBUS_TX_PIN);
  Serial.printf("[lin] UART%d RX=GPIO%d @ %d 8N1 (read-only)\n",
                NBUS_UART_NUM, NBUS_RX_PIN, NBUS_BAUD);

  WiFi.onEvent(onWifiEvent);
  startProvisioning();
  watchdogInit();
}

void loop() {
  esp_task_wdt_reset();

  readLin();
  handleProvisioning();
  if (g_netServicesUp) {
    httpServer.handleClient();
    ElegantOTA.loop();
  }

  // MQTT keepalive + non-blocking reconnect.
  if (mqtt.connected()) {
    mqtt.loop();
  } else if (WiFi.status() == WL_CONNECTED && !cfg.host.isEmpty() &&
             (millis() - g_lastMqttTryMs) > NBUS_MQTT_RETRY_MS) {
    g_lastMqttTryMs = millis();
    if (!mqttConnect()) {
      if (++g_mqttFailCount >= 60) {  // ~5 min of failures → reboot
        Serial.println(F("[mqtt] too many failures — rebooting"));
        delay(200);
        ESP.restart();
      }
    }
  }

  // Discovery once per connection, then throttled state publishing.
  if (mqtt.connected()) {
    // Republished when a device first names itself and whenever a reshuffle points a slot
    // at a different pack, not only on connect: at connect time no serial is known yet,
    // so that alone would leave Home Assistant with the bridge and nothing else.
    if (!g_discoverySent || identitySignature() != g_discoSignature) {
      publishDiscovery();
      g_discoverySent = true;
    }
    if (millis() - g_lastPublishMs > NBUS_PUBLISH_MS) {
      g_lastPublishMs = millis();
      publishState();
    }
  }

  // Bus silence is the trigger for everything this device was built to catch.
  // On a powerbank the ESP outlives the fault, so there is no rush and no need
  // for a brownout handler: the bus simply stops answering and we calmly write
  // the preceding minutes to flash. Edge-triggered — one dump per silence, not
  // one per loop — and re-armed only once frames actually resume.
  if (g_lastFrameMs && !g_otaActive) {
    const uint32_t age = millis() - g_lastFrameMs;
    if (!g_busSilent && age > NBUS_RAW_SILENCE_MS) {
      g_busSilent = true;
      Serial.printf("[raw] bus silent for %lu ms — persisting ring\n", (unsigned long)age);
      rawPersist("bus silent");
    } else if (g_busSilent && age < NBUS_RAW_SILENCE_MS) {
      g_busSilent = false;
      Serial.println(F("[raw] bus is back"));
    }
  }

  // Heartbeat: brief blink each second.
  if (millis() - g_lastHeartbeatMs > NBUS_HEARTBEAT_MS) {
    g_lastHeartbeatMs = millis();
    ledWrite(true);
    delay(5);
    ledWrite(false);
  }
}
